Examinator/src/Enums/ОтборыДанныхВебКабинетаСУО/ОтборыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтборыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>Активные</name>
  </enumValues>
  <enumValues>
    <name>Открытые</name>
  </enumValues>
  <enumValues>
    <name>Видимые</name>
  </enumValues>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>Исходящие</name>
  </enumValues>
  <enumValues>
    <name>Удаленные</name>
  </enumValues>
  <enumValues>
    <name>Помеченные</name>
  </enumValues>
  <enumValues>
    <name>Завершенные</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ОтборыДанныхВебКабинетаСУО/ManagerModule.bsl
#Если Сервер Тогда
	
Функция ВычислитьИдентификатор(Элемент) Экспорт
	
	Если ТипЗнч(Элемент) = Тип("ПеречислениеСсылка.ОтборыДанныхВебКабинетаСУО") Тогда
		
		Возврат Новый УникальныйИдентификатор(ОбщегоНазначенияСУ.УникальныйИдентификаторИзСтроки(ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Элемент)));
		
	ИначеЕсли ТипЗнч(Элемент) = Тип("УникальныйИдентификатор") Тогда
		
		Возврат Элемент;
		
	ИначеЕсли ТипЗнч(Элемент) = Тип("Строка") Тогда
		
		ИмяЗначенияПеречисления = ВебКабинетСУ.Перевод(Элемент, "ОтборыДанныхВебКабинетаСУО");
		
		Если ИмяЗначенияПеречисления = Элемент Тогда
			Идентификатор = Элемент;
		Иначе
			Идентификатор = ОбщегоНазначенияСУ.УникальныйИдентификаторИзСтроки(ИмяЗначенияПеречисления);
		КонецЕсли;
		
		Возврат Новый УникальныйИдентификатор(Идентификатор);
		
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Элемент)) И ЗначениеЗаполнено(Элемент) Тогда
		
		Возврат Элемент.УникальныйИдентификатор();
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция Идентификатор(Знач Элемент) Экспорт
	
	Если ТипЗнч(Элемент) = Тип("ПеречислениеСсылка.ОтборыДанныхВебКабинетаСУО") Тогда		
		
		Если Элемент = Перечисления.ОтборыДанныхВебКабинетаСУО.Активные Тогда
			Возврат Новый УникальныйИдентификатор("b727a579-0c22-8d34-1903-fd46bda4d307");	
		КонецЕсли;
		
		Если Элемент = Перечисления.ОтборыДанныхВебКабинетаСУО.Открытые Тогда
			Возврат Новый УникальныйИдентификатор("b2757279-0c22-8d34-1903-fd46bda4d307");	
		КонецЕсли;		
		
		Если Элемент = Перечисления.ОтборыДанныхВебКабинетаСУО.Видимые Тогда
			Возврат Новый УникальныйИдентификатор("a7f71791-0c22-8d34-1903-fd46bda4d307");	
		КонецЕсли;		
		
		Если Элемент = Перечисления.ОтборыДанныхВебКабинетаСУО.Входящие Тогда
			Возврат Новый УникальныйИдентификатор("a7bf2f79-0c22-8d34-1903-fd46bda4d307");	
		КонецЕсли;
		
		Если Элемент = Перечисления.ОтборыДанныхВебКабинетаСУО.Исходящие Тогда
			Возврат Новый УникальныйИдентификатор("797bf2f7-9c22-8d34-1903-fd46bda4d307");	
		КонецЕсли;
		
		Если Элемент = Перечисления.ОтборыДанныхВебКабинетаСУО.Удаленные Тогда
			Возврат Новый УникальныйИдентификатор("5fb29557-9c22-8d34-1903-fd46bda4d307");	
		КонецЕсли;
		
		Если Элемент = Перечисления.ОтборыДанныхВебКабинетаСУО.Помеченные Тогда
			Возврат Новый УникальныйИдентификатор("2b197955-7922-8d34-1903-fd46bda4d307");	
		КонецЕсли;
		
		Если Элемент = Перечисления.ОтборыДанныхВебКабинетаСУО.Завершенные Тогда
			Возврат Новый УникальныйИдентификатор("5ba95695-5792-8d34-1903-fd46bda4d307");	
		КонецЕсли;		
		
		Возврат ВычислитьИдентификатор(Элемент);
		
	Иначе
		
		Возврат ВычислитьИдентификатор(Элемент);
		
	КонецЕсли;
	
КонецФункции


#КонецЕсли
